------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\rsf94\Documents\bienestar\proyecto_final\proyecto_final.log
  log type:  text
 opened on:  12 Apr 2021, 23:53:52

. 
. global data "C:\Users\rsf94\Google Drive\MAESTRÍA ITAM\2do semestre\Bienestar y política social\Bienestar_equipo\trabajo_final\data_raw"

. 
. * =================================
. * CARGAR DATOS
. * =================================
. * Abro base de hogares y guardo en formato de Stata para el merge
. import delimited "$data\ponde_Hogar_ENA_2016_pp.csv"
(48 vars, 55,907 obs)

. rename ïid_hogar id_hogar

. save "$data\hogares.dta",replace
file C:\Users\rsf94\Google Drive\MAESTRÍA ITAM\2do semestre\Bienestar y política social\Bienestar_equipo\trabajo_final\data_raw\hogares.dta saved

. 
. clear

. 
. * Importar bases de datos: individuos y hogares
. import delimited "$data\ENCODAT 2016_2017.csv"
(1,715 vars, 56,877 obs)

. split id_pers, parse()
variables created as string: 
id_pers1  id_pers2

. rename id_pers1 id_hogar

. rename id_pers2 id_ind

. 
. * Merge entre base de individuos y hogares
. merge m:1 id_hogar using "$data\hogares.dta"
(note: variable desc_loc was str50, now str54 to accommodate using data's values)

    Result                           # of obs.
    -----------------------------------------
    not matched                        10,245
        from master                        19  (_merge==1)
        from using                     10,226  (_merge==2)

    matched                            56,858  (_merge==3)
    -----------------------------------------

. replace id_ind = "1" if _merge==1
(19 real changes made)

. keep if _merge != 2
(10,226 observations deleted)

. 
. * =================================
. * LIMPIEZA DE DATOS
. * =================================
. 
. 
. * =================================
. * GENERAMOS VARIABLES DE INTERÉS
. * =================================
. 
. * ------ Sociodemográficas
. * ds2: sexo
. gen mujer =1 if ds2 ==2
(23,820 missing values generated)

. replace mujer =0 if ds2==1
(23,820 real changes made)

. 
. * ds3: edad
. rename ds3 edad

. 
. * ds6: estado civil
. gen matrimonio = 1 if ds6 ==1
(36,673 missing values generated)

. replace matrimonio = 0 if ds6>1
(36,673 real changes made)

. 
. * ds7: religion
. 
. * h315: ingreso autoreportado
. rename h315 ingreso

. 
. * beneficiario de programa del gobierno
. *       1. Apoyo monetario Prospera h317a
.                 gen prospera_mon =1 if h317a==1
(42,002 missing values generated)

.                 replace prospera_mon = 0 if h317a!=1
(42,002 real changes made)

. *       2. Apoyo becas Prospera h317b
.                 gen prospera_bec = 1 if h317b==1
(47,556 missing values generated)

.                 replace prospera_bec = 0 if h317b != 1
(47,556 real changes made)

. 
. * faltan las preguntas asociadas a trabajo
. 
. 
. * ------ Tratamiento y respuesta
. 
. * ds8: actualmente estudia
. tab ds8 [aw=ponde_ss]

        ds8 |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 | 1,271.6427        2.24        2.24
          2 | 42,750.418       75.16       77.40
          3 | 12,854.939       22.60      100.00
------------+-----------------------------------
      Total |     56,877      100.00

. gen estudia =1 if ds8==3
(43,633 missing values generated)

. replace estudia=0 if ds8<3
(43,633 real changes made)

. 
. tab estudia [aw=ponde_ss]

    estudia |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 44,022.061       77.40       77.40
          1 | 12,854.939       22.60      100.00
------------+-----------------------------------
      Total |     56,877      100.00

. 
. * edad_estudiar: 1 si la persona tiene menos de 2_ años
. gen edad_estudiar = 1 if edad <= 20
(41,294 missing values generated)

. replace edad_estudiar = 0 if edad > 20
(41,294 real changes made)

. 
. * desempleo si lleva más de 46 días desempleado (ds15) (requisito para retirar  de tu AFORE)
. gen desempleo = 1 if ds15 > 46 & ds10==2
(28,951 missing values generated)

. replace desempleo = 0 if ds10==1
(28,561 real changes made)

. 
. * tb02: fuma
. gen fuma = 1 if tb02<=2
(48,904 missing values generated)

. replace fuma = 0 if tb02>2
(48,904 real changes made)

. tab fuma [aw=ponde_ss]

       fuma |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 46,935.731       82.52       82.52
          1 |9,941.26949       17.48      100.00
------------+-----------------------------------
      Total |     56,877      100.00

. 
. 
. * ed1: te han regalado mariguana
. * ed5: te han regalado otras drogas
. * generamos variable que indica si ha recibido drogas regaladas
. gen regalo = 1 if ed1==1 | ed5==1
(44,786 missing values generated)

. replace regalo = 0 if ed1==2 & ed5==2
(44,786 real changes made)

. 
. * ed11: facilidad de acceso a drogas
. gen facilidad = 1 if ed11 >=4
(12,412 missing values generated)

. replace facilidad = 0 if ed11 <4
(12,412 real changes made)

. 
. * pc1: platica de prevencion
. gen prevencion = 1 if pc1==1
(29,497 missing values generated)

. replace prevencion = 0 if pc1 >1
(29,497 real changes made)

. 
. * =================================
. * RELACIONES ENTRE VARIABLES
. * =================================
. 
. * Estudia Y está en edad de estudiar
. tab edad_estudiar estudia [aw=ponde_ss], cell

+-----------------+
| Key             |
|-----------------|
|    frequency    |
| cell percentage |
+-----------------+

edad_estud |        estudia
       iar |         0          1 |     Total
-----------+----------------------+----------
         0 | 39,656.79  2,890.735 | 42,547.52 
           |     69.72       5.08 |     74.81 
-----------+----------------------+----------
         1 | 4,365.272  9,964.205 | 14,329.48 
           |      7.67      17.52 |     25.19 
-----------+----------------------+----------
     Total | 44,022.06  12,854.94 |    56,877 
           |     77.40      22.60 |    100.00 

. 
. * Desempleados si están en edad de estudiar
.  tab desempleo edad_estudiar

           |     edad_estudiar
 desempleo |         0          1 |     Total
-----------+----------------------+----------
         0 |    25,127      3,434 |    28,561 
         1 |    15,890     12,036 |    27,926 
-----------+----------------------+----------
     Total |    41,017     15,470 |    56,487 

. 
.  
.  * Histograma edad
.  hist edad, bin(10)
(bin=10, start=12, width=5.3)

. 
end of do-file

. tab fuma

       fuma |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     48,904       85.98       85.98
          1 |      7,973       14.02      100.00
------------+-----------------------------------
      Total |     56,877      100.00

. tab ed11

       ed11 |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      1,200        2.11        2.11
          2 |      2,565        4.51        6.62
          3 |      8,647       15.20       21.82
          4 |     23,353       41.06       62.88
          5 |     16,854       29.63       92.51
          9 |      4,258        7.49      100.00
------------+-----------------------------------
      Total |     56,877      100.00

. tab ed7
ed7 ambiguous abbreviation
r(111);

. tab ed7a

       ed7a |      Freq.     Percent        Cum.
------------+-----------------------------------
          4 |          1        0.02        0.02
          5 |          2        0.04        0.06
          8 |          3        0.06        0.12
          9 |          3        0.06        0.18
         10 |          8        0.16        0.35
         11 |         27        0.55        0.89
         12 |        152        3.09        3.98
         13 |        192        3.90        7.87
         14 |        307        6.23       14.11
         15 |        515       10.45       24.56
         16 |        446        9.05       33.61
         17 |        462        9.38       42.99
         18 |        524       10.64       53.62
         19 |        254        5.16       58.78
         20 |        457        9.28       68.05
         21 |        101        2.05       70.10
         22 |        196        3.98       74.08
         23 |         98        1.99       76.07
         24 |         98        1.99       78.06
         25 |        184        3.73       81.79
         26 |         69        1.40       83.19
         27 |         47        0.95       84.15
         28 |         79        1.60       85.75
         29 |         15        0.30       86.06
         30 |        152        3.09       89.14
         31 |          7        0.14       89.28
         32 |         31        0.63       89.91
         33 |         26        0.53       90.44
         34 |         13        0.26       90.70
         35 |         62        1.26       91.96
         36 |         19        0.39       92.35
         37 |         13        0.26       92.61
         38 |         18        0.37       92.98
         39 |          9        0.18       93.16
         40 |         54        1.10       94.26
         41 |          6        0.12       94.38
         42 |         13        0.26       94.64
         43 |          6        0.12       94.76
         44 |          4        0.08       94.84
         45 |         22        0.45       95.29
         46 |          7        0.14       95.43
         47 |          6        0.12       95.56
         48 |          7        0.14       95.70
         49 |          4        0.08       95.78
         50 |         14        0.28       96.06
         51 |          3        0.06       96.12
         52 |          5        0.10       96.22
         53 |          1        0.02       96.25
         54 |          3        0.06       96.31
         55 |          3        0.06       96.37
         56 |          1        0.02       96.39
         57 |          1        0.02       96.41
         58 |          4        0.08       96.49
         59 |          3        0.06       96.55
         60 |          3        0.06       96.61
         63 |          1        0.02       96.63
         64 |          1        0.02       96.65
        111 |         13        0.26       96.91
        119 |         87        1.77       98.68
        120 |         55        1.12       99.80
        999 |         10        0.20      100.00
------------+-----------------------------------
      Total |      4,927      100.00

. tab ed7b

       ed7b |      Freq.     Percent        Cum.
------------+-----------------------------------
          7 |          1        0.07        0.07
          8 |          1        0.07        0.14
         10 |          3        0.20        0.34
         11 |          9        0.61        0.95
         12 |         37        2.50        3.45
         13 |         62        4.19        7.65
         14 |         95        6.43       14.07
         15 |        150       10.15       24.22
         16 |        145        9.81       34.03
         17 |        155       10.49       44.52
         18 |        150       10.15       54.67
         19 |         87        5.89       60.55
         20 |        115        7.78       68.34
         21 |         33        2.23       70.57
         22 |         66        4.47       75.03
         23 |         32        2.17       77.20
         24 |         23        1.56       78.76
         25 |         50        3.38       82.14
         26 |         13        0.88       83.02
         27 |         14        0.95       83.96
         28 |         24        1.62       85.59
         29 |          8        0.54       86.13
         30 |         47        3.18       89.31
         31 |          1        0.07       89.38
         32 |          9        0.61       89.99
         33 |          7        0.47       90.46
         34 |          8        0.54       91.00
         35 |         16        1.08       92.08
         36 |          5        0.34       92.42
         37 |          3        0.20       92.63
         38 |          5        0.34       92.96
         39 |          2        0.14       93.10
         40 |         14        0.95       94.05
         41 |          2        0.14       94.18
         42 |          3        0.20       94.38
         43 |          1        0.07       94.45
         44 |          1        0.07       94.52
         45 |          6        0.41       94.93
         46 |          2        0.14       95.06
         47 |          1        0.07       95.13
         48 |          1        0.07       95.20
         49 |          1        0.07       95.26
         50 |          4        0.27       95.53
         52 |          4        0.27       95.81
         53 |          1        0.07       95.87
         54 |          1        0.07       95.94
         58 |          1        0.07       96.01
         60 |          2        0.14       96.14
         64 |          1        0.07       96.21
        111 |          5        0.34       96.55
        119 |         34        2.30       98.85
        120 |         14        0.95       99.80
        999 |          3        0.20      100.00
------------+-----------------------------------
      Total |      1,478      100.00

. tab f1
variable f1 not found
r(111);

. tab dm1
dm1 ambiguous abbreviation
r(111);

. tab dm1a

       dm1a |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      1,017        1.79        1.79
          2 |     53,818       94.62       96.41
          9 |      2,042        3.59      100.00
------------+-----------------------------------
      Total |     56,877      100.00

. summarize(dm1a)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        dm1a |     56,877    2.233434    1.312486          1          9

. do "C:\Users\rsf94\AppData\Local\Temp\STD4500_000000.tmp"

.         tab dm1*
too many variables specified
r(103);

end of do-file

r(103);

. do "C:\Users\rsf94\AppData\Local\Temp\STD4500_000000.tmp"

.         tab dm1a-c
c ambiguous abbreviation
r(111);

end of do-file

r(111);

. do "C:\Users\rsf94\AppData\Local\Temp\STD4500_000000.tmp"

.         tab dm1
dm1 ambiguous abbreviation
r(111);

end of do-file

r(111);

. do "C:\Users\rsf94\AppData\Local\Temp\STD4500_000000.tmp"

.         tab dm1a

       dm1a |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      1,017        1.79        1.79
          2 |     53,818       94.62       96.41
          9 |      2,042        3.59      100.00
------------+-----------------------------------
      Total |     56,877      100.00

.         tab dm1b

       dm1b |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      2,499        4.39        4.39
          2 |     53,578       94.20       98.59
          9 |        800        1.41      100.00
------------+-----------------------------------
      Total |     56,877      100.00

.         tab dm1c

       dm1c |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        380        0.67        0.67
          2 |     55,891       98.27       98.93
          9 |        606        1.07      100.00
------------+-----------------------------------
      Total |     56,877      100.00

.         tab dm1d

       dm1d |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        376        0.66        0.66
          2 |     55,958       98.38       99.05
          9 |        543        0.95      100.00
------------+-----------------------------------
      Total |     56,877      100.00

. 
end of do-file

. help tab1

. do "C:\Users\rsf94\AppData\Local\Temp\STD4500_000000.tmp"

.         tab1 dm1a dm1b

-> tabulation of dm1a  

       dm1a |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      1,017        1.79        1.79
          2 |     53,818       94.62       96.41
          9 |      2,042        3.59      100.00
------------+-----------------------------------
      Total |     56,877      100.00

-> tabulation of dm1b  

       dm1b |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      2,499        4.39        4.39
          2 |     53,578       94.20       98.59
          9 |        800        1.41      100.00
------------+-----------------------------------
      Total |     56,877      100.00

. 
end of do-file

. tab1 dm1*

-> tabulation of dm1a  

       dm1a |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      1,017        1.79        1.79
          2 |     53,818       94.62       96.41
          9 |      2,042        3.59      100.00
------------+-----------------------------------
      Total |     56,877      100.00

-> tabulation of dm1b  

       dm1b |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      2,499        4.39        4.39
          2 |     53,578       94.20       98.59
          9 |        800        1.41      100.00
------------+-----------------------------------
      Total |     56,877      100.00

-> tabulation of dm1c  

       dm1c |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        380        0.67        0.67
          2 |     55,891       98.27       98.93
          9 |        606        1.07      100.00
------------+-----------------------------------
      Total |     56,877      100.00

-> tabulation of dm1d  

       dm1d |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        376        0.66        0.66
          2 |     55,958       98.38       99.05
          9 |        543        0.95      100.00
------------+-----------------------------------
      Total |     56,877      100.00

-> tabulation of dm1a2  

      dm1a2 |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         18        3.13        3.13
          2 |        532       92.52       95.65
          9 |         25        4.35      100.00
------------+-----------------------------------
      Total |        575      100.00

-> tabulation of dm1b2  

      dm1b2 |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         97       16.87       16.87
          2 |        457       79.48       96.35
          9 |         21        3.65      100.00
------------+-----------------------------------
      Total |        575      100.00

-> tabulation of dm1c2  

      dm1c2 |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         14        2.43        2.43
          2 |        540       93.91       96.35
          9 |         21        3.65      100.00
------------+-----------------------------------
      Total |        575      100.00

-> tabulation of dm1d2  

      dm1d2 |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         20        3.48        3.48
          2 |        537       93.39       96.87
          9 |         18        3.13      100.00
------------+-----------------------------------
      Total |        575      100.00

. tab1 dm1a-dm1e
variable dm1e not found
r(111);

. tab1 dm1a*

-> tabulation of dm1a  

       dm1a |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      1,017        1.79        1.79
          2 |     53,818       94.62       96.41
          9 |      2,042        3.59      100.00
------------+-----------------------------------
      Total |     56,877      100.00

-> tabulation of dm1a2  

      dm1a2 |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         18        3.13        3.13
          2 |        532       92.52       95.65
          9 |         25        4.35      100.00
------------+-----------------------------------
      Total |        575      100.00

. do "C:\Users\rsf94\AppData\Local\Temp\STD4500_000000.tmp"

.         tab1 dm1a dm1b dm1c dm1d

-> tabulation of dm1a  

       dm1a |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      1,017        1.79        1.79
          2 |     53,818       94.62       96.41
          9 |      2,042        3.59      100.00
------------+-----------------------------------
      Total |     56,877      100.00

-> tabulation of dm1b  

       dm1b |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      2,499        4.39        4.39
          2 |     53,578       94.20       98.59
          9 |        800        1.41      100.00
------------+-----------------------------------
      Total |     56,877      100.00

-> tabulation of dm1c  

       dm1c |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        380        0.67        0.67
          2 |     55,891       98.27       98.93
          9 |        606        1.07      100.00
------------+-----------------------------------
      Total |     56,877      100.00

-> tabulation of dm1d  

       dm1d |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        376        0.66        0.66
          2 |     55,958       98.38       99.05
          9 |        543        0.95      100.00
------------+-----------------------------------
      Total |     56,877      100.00

. 
end of do-file

. do "C:\Users\rsf94\AppData\Local\Temp\STD4500_000000.tmp"

.         tab dm6a dm8a

           |               dm8a
      dm6a |         1          3          4 |     Total
-----------+---------------------------------+----------
         1 |         1          1          2 |         4 
-----------+---------------------------------+----------
     Total |         1          1          2 |         4 

. 
end of do-file

. tab dm6a

       dm6a |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |          4        8.89        8.89
          2 |         41       91.11      100.00
------------+-----------------------------------
      Total |         45      100.00

. tabdm8a
command tabdm8a is unrecognized
r(199);

. tab dm8a

       dm8a |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |          3       18.75       18.75
          2 |          1        6.25       25.00
          3 |          3       18.75       43.75
          4 |          9       56.25      100.00
------------+-----------------------------------
      Total |         16      100.00

. tab dm6a dm8a

           |               dm8a
      dm6a |         1          3          4 |     Total
-----------+---------------------------------+----------
         1 |         1          1          2 |         4 
-----------+---------------------------------+----------
     Total |         1          1          2 |         4 

. crosstab
command crosstab is unrecognized
r(199);

. tab dm6a dm8a [aw=ponde_ss], cell

+-----------------+
| Key             |
|-----------------|
|    frequency    |
| cell percentage |
+-----------------+

           |               dm8a
      dm6a |         1          3          4 |     Total
-----------+---------------------------------+----------
         1 | .60150026  .75304442  2.6454553 |         4 
           |     15.04      18.83      66.14 |    100.00 
-----------+---------------------------------+----------
     Total | .60150026  .75304442  2.6454553 |         4 
           |     15.04      18.83      66.14 |    100.00 

. do "C:\Users\rsf94\AppData\Local\Temp\STD4500_000000.tmp"

.         tab dm6a dm3a
dm3a ambiguous abbreviation
r(111);

end of do-file

r(111);

. tab dm6a dm3a
dm3a ambiguous abbreviation
r(111);

. tab dm6a dm3aa

           |              dm3aa
      dm6a |         1          2          9 |     Total
-----------+---------------------------------+----------
         1 |         3          0          1 |         4 
         2 |        35          1          1 |        37 
-----------+---------------------------------+----------
     Total |        38          1          2 |        41 

. tab dm6b dm3bb

           |              dm3bb
      dm6b |         1          2          9 |     Total
-----------+---------------------------------+----------
         1 |        14          0          1 |        15 
         2 |        59          3          2 |        64 
-----------+---------------------------------+----------
     Total |        73          3          3 |        79 

. tab dm6b dm3ba

           |              dm3ba
      dm6b |         1          2          9 |     Total
-----------+---------------------------------+----------
         1 |        45          1          1 |        47 
         2 |       303          4          1 |       308 
-----------+---------------------------------+----------
     Total |       348          5          2 |       355 

. tab dm6b dmba
variable dmba not found
r(111);

. log close
      name:  <unnamed>
       log:  C:\Users\rsf94\Documents\bienestar\proyecto_final\proyecto_final.log
  log type:  text
 closed on:  13 Apr 2021, 00:40:55
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
